# taps
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# formulae
brew "aichat"
brew "bat"
brew "diskus"
brew "fd"
brew "fish"
brew "fisher" # fish package manager; requires fish
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gnupg" # gnupg2 was a transitional package before gnupg was updated
brew "htop"
brew "jq"
brew "libpq" # provides psql command
brew "liquidprompt" # bash prompt
brew "lsd"
brew "nano"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "xz" # required for python
brew "zoxide"

# casks
cask "1password"
cask "1password-cli"
cask "adguard"
cask "adguard-vpn"
# cask "alacritty", args: {"no-quarantine": true} # brew install --cask --no-quarantine
cask "alfred"
cask "chatgpt"
# cask "cleanmymac"
cask "cleanshot"
cask "discord"
# cask "disk-drill"
cask "docker"
cask "hyper"
cask "insomnia"
cask "istat-menus"
# cask "jetbrains-toolbox"
cask "keybase"
cask "lunar"
# cask "marked"
cask "microsoft-edge"
cask "pixelsnap"
cask "readdle-spark"
cask "rectangle"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
# cask "transmit"
cask "visual-studio-code" # also install https://code.visualstudio.com/insiders side-by-side

# font casks
cask "font-caskaydia-cove-nerd-font"
cask "font-symbols-only-nerd-font" # fallback symbols font
