# taps
tap "homebrew/bundle"
tap "homebrew/cask" # tapped by default
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core" # tapped by default
tap "homebrew/services"
tap "nodenv/nodenv"

# formulae
brew "bash"
brew "bash-completion@2" # requires bash
brew "bat"
brew "deno"
brew "diskus"
brew "exa"
brew "fd"
brew "fish"
brew "fisher" # fish package manager; requires fish
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gnupg" # gnupg2 was a transitional package for both brew and apt
brew "go"
brew "htop"
brew "imagemagick"
brew "jq"
brew "kubectx" # requires kubernetes-cli
brew "kubernetes-cli"
brew "libpq" # provides psql command
brew "liquidprompt" # bash prompt
brew "nano"
brew "nodenv"
brew "nodenv/nodenv/nodenv-package-rehash"
brew "nodenv/nodenv/nodenv-default-packages" # installs packages from ~/.nodenv/default-packages
brew "pure" # zsh prompt
brew "python@3.10" # required for google-cloud-sdk
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "speedtest-cli"
brew "spotify-tui"
brew "tmux"
brew "tree"
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "zoxide"
brew "zsh"

# casks
cask "1password"
cask "1password-cli"
cask "adguard-vpn"
cask "alacritty", args: {"no-quarantine": true} # brew install --cask --no-quarantine
cask "cleanmymac"
cask "cleanshot"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "figma"
cask "google-cloud-sdk"
cask "insomnia"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "keybase"
cask "lunar"
cask "marked"
cask "microsoft-edge"
cask "pixelsnap"
cask "readdle-spark"
cask "rectangle"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "transmit"
cask "visual-studio-code"

# font casks
cask "font-caskaydia-cove-nerd-font"
cask "font-symbols-only-nerd-font"
