# taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# formulae
brew "bat"
brew "diskus"
brew "fd"
brew "fish"
brew "fisher" # fish package manager; requires fish
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg" # gnupg2 was a transitional package before gnupg was updated
brew "htop"
brew "imagemagick"
brew "jq"
brew "libpq" # provides psql command
brew "libsodium" # required by some node-gyp packages
brew "liquidprompt" # bash prompt
brew "lsd"
brew "nano"
brew "openssl" # requires ca-certificates
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "xz" # required for python
brew "zoxide"

# casks
cask "1password"
cask "1password-cli"
cask "adguard"
cask "adguard-vpn"
# cask "alacritty", args: {"no-quarantine": true} # brew install --cask --no-quarantine
cask "alfred"
cask "alt-tab"
cask "cleanmymac"
cask "cleanshot"
cask "discord"
# cask "disk-drill"
cask "docker"
cask "eloston-chromium"
cask "hyper"
cask "insomnia"
cask "istat-menus"
# cask "jetbrains-toolbox"
cask "lunar"
# cask "marked"
cask "pixelsnap"
cask "rectangle"
cask "spotify"
# cask "transmit"
cask "visual-studio-code"

# font casks
cask "font-caskaydia-cove-nerd-font"
cask "font-symbols-only-nerd-font" # fallback symbols font
